Revit 2015 API
IFCFile.CreateCurveBoundedPlane Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public IFCAnyHandle CreateCurveBoundedPlane(
	IList<XYZ> outerLoop,
	IList<IList<XYZ>> innerLoops
)
Visual Basic
Public Function CreateCurveBoundedPlane ( _
	outerLoop As IList(Of XYZ), _
	innerLoops As IList(Of IList(Of XYZ)) _
) As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ CreateCurveBoundedPlane(
	IList<XYZ^>^ outerLoop,
	IList<IList<XYZ^>^>^ innerLoops
)
Parameters
outerLoop
Type: System.Collections.Generic.IList<XYZ>
innerLoops
Type: System.Collections.Generic.IList<IList<XYZ>>
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace